blog/aesara-applications.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-09 Fri 09:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Interesting applications of Aesara</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Interesting applications of Aesara</h1>
<p>
Working on <a href="../20220729163627-aesara.html#ID-5a5e87b1-558c-43db-ad38-32a073b10351">Aesara</a> and its related projects <a href="../20220824141859-aeppl.html#ID-e18d689a-392a-407a-941a-f0ad2d2dc43e">AePPL</a> and <a href="../20220823093947-aemcmc.html#ID-7d019ab6-c3f5-4f63-b689-ece3b88afcc2">AeMCMC</a> I have come to realize the versatility and flexibiliy of the ecosystem that we are building. Aesara was built to be <i>modular</i>, which means that pretty much everything in the library can be hacked to fit one's particular use case:
</p>

<ul class="org-ul">
<li>You can create new <code>Op</code>\s. These <code>Op</code>\s don't need to be functional and can be used just as an intermediate representation. AePPL, for instance, takes an Aesara model with <code>RandomVariable</code>\s and transforms it into a graph between measures. These measures are not used to perform computations, but instead to compute the density of the model. And soon by AeMCMC to automatically build samplers from models.</li>
<li>You can implement new rewrites/optimizations. You found an optimization that makes your model run faster? You can implement it and register it in Aesara's rewrite database easily.</li>
<li>You can transform parts of your graph into an <code>Op</code> that can be target by rewrites.</li>
<li>You can add a new backend. A new framework came up and you'd like your Aesara models to run with it? You can easily add a new backend, even implement it in a different repository.</li>
</ul>

<p>
When you work on a project like this many ideas of applications pop up, but time is limited. So I am laying everything out here, hoping someone will take one of these ideas and run with it.
</p>

<div id="outline-container-org9c070fd" class="outline-2">
<h2 id="org9c070fd">Neural network library</h2>
<div class="outline-text-2" id="text-org9c070fd">
<p>
Theano was completely oriented towards neural networks, but Aesara kind of departed from this to focus on the core functionalities of a tensor library. I see a couple reasons why it would be great to have a neural network library in Aesara.
</p>

<p>
First, deep learning frameworks come and go, and it is not uncommon to have to rewrite one's model several times in different frameworks. Once you have written your model in Aesara, however, you can compile to different backends. Working with the latest compiler is only a matter of adding it as a backend in Aesara, which would benefit the <i>entire Aesara ecosystem</i>.
</p>

<p>
But the biggest benefits come from the ability to give layers a <i>type</i> by creating <code>Op</code>\s from their Aesara implementation. Having layer types means you can target them with rewrites, and I see two exciting possibilities coming from this.
</p>
</div>

<div id="outline-container-org4fff43a" class="outline-3">
<h3 id="org4fff43a">AutoML</h3>
<div class="outline-text-3" id="text-org4fff43a">
<p>
<b>AutoML.</b> Tired of always making small changes to your models to get an increase in performance? Aesara can automate that! Implement what you manually do as rewrites (increasing the layer size, adding dropout, etc.) and Aesara will output different versions of your model. This means you will only ever have to touch the model implementation once, but also now you can re-use your rewrites for your next models. You are making cumulative progress instead of having to do the same thing over and over. In addition, Aesara's rewrite system will soon include a form of <a target='_blank' rel='noopener noreferrer' class='external' href="https://arxiv.org/abs/1012.1802">equality saturation</a>, which means that it will be able to return all the possible models that are defined by your rewrite rules. Now that's <i>true automation</i>.
</p>
</div>
</div>

<div id="outline-container-org2c320c6" class="outline-3">
<h3 id="org2c320c6">Higher-level optimizations</h3>
<div class="outline-text-3" id="text-org2c320c6">
<p>
Compilers used in deep learning are generally good at optimizing the low-level optimizations (constant folding, loop fusions, etc.), but they cannot reason at the mathematical level. There are however <a target='_blank' rel='noopener noreferrer' class='external' href="https://github.com/uwplse/tensat/blob/master/single_rules.txt">plenty of optimizations</a> that can be performed by reasoning at the layer level, and an Aesara-based DL library could target layers with rewrites to transform the model into a different but mathematically equivalent representation. This kind of rewrites <a target='_blank' rel='noopener noreferrer' class='external' href="https://github.com/jiazhihao/TASO">has been shown</a> to outperform existing compilers by up to a factor of 3.
</p>
</div>
</div>
</div>

<div id="outline-container-org1dacbba" class="outline-2">
<h2 id="org1dacbba">Gaussian processes</h2>
<div class="outline-text-2" id="text-org1dacbba">
<p>
A Gaussian process library could add kernels as types, and implement rewrites that allow to build models automatically by manipulating kernels. This is essentially what David Duvenaud did in <a target='_blank' rel='noopener noreferrer' class='external' href="https://www.cs.toronto.edu/~duvenaud/thesis.pdf">his PhD thesis</a>.
</p>
</div>
</div>

<div id="outline-container-org603cce8" class="outline-2">
<h2 id="org603cce8">Probabilistic circuits</h2>
</div>
</div>
</body>
</html>